#ifndef Drivers_H
#define Drivers_H

#include <avr/io.h>
#include <avr/interrupt.h>

//ключ модуля уборщика
//================================================================================
#define ON_Cleaner PORTC |= (1<<4)
#define OFF_Cleaner PORTC &= ~(1<<4)
//================================================================================


//временные задержки для привода
//на месте(двумя колесами)
#define TURN_90		750		//поворот на 90 град
#define TURN_180	1500	//поворот на 180 град
#define TURN_160	1400	//поворот на 160 град

//заворот(одним колесом)
#define WRAP_90		1300	//заворот на 90 град

//Приводные двигатели
//================================================================================
extern void M_drive(signed char l_vector, char l_speed, signed char r_vector, char r_speed);				
//================================================================================

#endif
